[{"parameterName": "@version", "type": "string", "cardinality": "[0..1]", "description": "Web Service version"}, {"parameterName": "Request_References", "type": "Worker_Request_References", "Worker_Request_References": [{"parameterName": " @Skip_Non_Existing_Instances", "type": "boolean", "cardinality": "[0..1]", "description": ""}, {"parameterName": " @Ignore_Invalid_References", "type": "boolean", "cardinality": "[0..1]", "description": ""}, {"parameterName": "Worker_Reference", "type": "WorkerObject", "WorkerObject": [{"parameterName": " @Descriptor", "type": "string", "cardinality": "[0..1]", "description": "Display information used to describe an instance of an object. This 'optional' information is for outbound descriptive purposes only and is not processed on inbound Workday Web Services requests."}, {"parameterName": "ID", "type": "WorkerObjectID", "WorkerObjectID": [{"parameterName": "#text", "type": "string", "cardinality": "", "description": ""}, {"parameterName": " @type", "type": "WID,  Contingent_Worker_ID,  Employee_ID", "cardinality": "[1..1]", "description": "The unique identifier type. Each \"ID\" for an instance of an object contains a type and a value. A single instance of an object can have multiple \"ID\" but only a single \"ID\" per \"type\".  Some \"types\" require a reference to a parent instance."}], "cardinality": "[0..*]", "description": "Contains a unique identifier for an instance of an object."}], "cardinality": "[1..*]", "description": "A reference to the ID of the worker. The ID consists of a type attribute, which should be set to \"Employee_ID\" or \"Contingent_Worker_ID\", and a value attribute, such as \"04345\".   If Skip Non Existing Instances value is set to true. When a reference id value that does not meet the entry date criteria is passed, the non existent reference id will be ignored."}], "cardinality": "[0..1]", "description": "Utilize the Request References element to retrieve a specific instance(s) of Worker and its associated data."}, {"parameterName": "Response_Filter", "type": "Response_Filter", "Response_Filter": [{"parameterName": "As_Of_Effective_Date", "type": "date", "cardinality": "[0..1]", "description": "Indicates the date when application data, such as benefits and compensation, become effective (Also referred to as the Effective Moment). If you don't specify a date, this date defaults to today.{+4}"}, {"parameterName": "As_Of_Entry_DateTime", "type": "dateTime", "cardinality": "[0..1]", "description": "The date and time the data was entered into the system. (This field is also referred to as the Entry Moment). If the date isn't specified, the default date is the current date and time."}, {"parameterName": "Page", "type": "decimal (12, 0)  >0 ", "cardinality": "[0..1]", "description": "The numbered page of data Workday returns in the response. The default page is the first page(Page = 1). For responses that contain more than one page of data, use this parameter to retrieve the additional pages of data. For example, set Page = 2 to retrieve the second page of data.Note: If you set the page parameter, you must also specify the \"As_Of_Entry_Date\" to ensure that the result set remains the same between your requests."}, {"parameterName": "Count", "type": "decimal (3, 0)  >0 ", "cardinality": "[0..1]", "description": "Sets the number of objects to return within each response page. Set a value between 1 and 999. The default value is 100."}], "cardinality": "[0..1]", "description": "Parameters that let you filter the data returned in the response. You can filter returned data by dates and page attributes.", "validation": [{"validation": "Page Number cannot be zero. ", "description": "Page number cannot be zero. "}]}, {"parameterName": "Response_Group", "type": "Worker_Response_Group_for_Reference", "Worker_Response_Group_for_Reference": [{"parameterName": "Include_Reference", "type": "boolean", "cardinality": "[0..1]", "description": "Indicates if the Reference to the Worker should be included in the response at the Previous_System_Job_History element level. It is always returned in the Previous_System_Job_History_Data level."}], "cardinality": "[0..1]", "description": "The response group allows for the response data to be tailored to only included elements that the user is looking for.  If no response group is provided in the request, then all groups will be returned. If the Response Group element is returned, you can select which sections of data to include in the response."}]