[{"operation": "Cancel_Billing_Schedule", "description": "This service will cancel a Billing Schedule", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Billing_Schedule.html", "service": "Revenue_Management"}, {"operation": "Cancel_Cash_Sale", "description": "This service will cancel a Cash Sale", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Cash_Sale.html", "service": "Revenue_Management"}, {"operation": "Cancel_Consolidated_Invoice", "description": "This operation will cancel a consolidated invoice.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Consolidated_Invoice.html", "service": "Revenue_Management"}, {"operation": "Cancel_Customer_Contract", "description": "This service will cancel a Customer Contract", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Customer_Contract.html", "service": "Revenue_Management"}, {"operation": "Cancel_Customer_Deposit", "description": "Cancels the single instance of the customer deposit when it has an associated Reference                  ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Customer_Deposit.html", "service": "Revenue_Management"}, {"operation": "Cancel_Customer_Invoice", "description": "This service will cancel a Customer Invoice", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Customer_Invoice.html", "service": "Revenue_Management"}, {"operation": "Cancel_Customer_Invoice_Adjustment", "description": "This service will cancel  a Customer Invoice Adjustment", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Customer_Invoice_Adjustment.html", "service": "Revenue_Management"}, {"operation": "Cancel_Customer_Payment", "description": "Cancels the single instance of the customer payment when it has an associated Reference                  ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Customer_Payment.html", "service": "Revenue_Management"}, {"operation": "Cancel_Revenue_Recognition_Schedule", "description": "This service will cancel a Revenue Recognition Schedule", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Cancel_Revenue_Recognition_Schedule.html", "service": "Revenue_Management"}, {"operation": "Correct_Award", "description": "This service operation will update Awards and submit to the Correct Award business                  process. Award data includes Award Reference ID, Submit Flag, Locked in Workday Flag,                  Award Number, Company, Sponsor Award Reference Number, Award Name, Award Description,                  Effective and Signed Dates, Award Type, Purpose Code, Payment Terms, Institutional                  ID, Related Award, Organizations for Award Reference, Sub Award Flag, Sponsor, Flowt                  Through Sponsor, Bill to Sponsor, Payment Type, Letter of Credit, Letter of Credit                  Document ID, Currency, Sponsor Direct Cost, Sponsor Facilities and Administration                  Amount, Cost Share Total Amount, Authorized Amount, Cost Share Required by Sponsor                  Flag, Anticipated Sponsor Direct Cost Amont, Anticipated Facilities and Administration                  Amount, Award Schedule, CFDA Number Reference, NSF Code, Proposal ID, Proposal Version,                  Award Notes, Billing Notes, Award Contract Line Data, and Award Attachement Data.                  Award Contract Line Data includes ID, Line Number, Revenue Category, Line Type, Line                  Description, Deferred Revenue Flag, Primary Grant Flag, Grant, Line Amount, Rate Agreement,                  Cost Rate Type, Exception, Revenue Allocation Profile, Basis Limit Data, Start and                  End Dates, Description, Line Invoice Memo Override, Default Worktags, Supplier, Line                  Billing Notes, and Revenue Recognition Line Notes.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Correct_Award.html", "service": "Revenue_Management"}, {"operation": "Get_Ad_Hoc_Project_Transaction_Custom_References", "description": "Returns Ad Hoc Project Transaction Custom References.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Ad_Hoc_Project_Transaction_Custom_References.html", "service": "Revenue_Management"}, {"operation": "Get_Ad_Hoc_Project_Transactions", "description": "This web service operation will get Ad Hoc Project Transactions. If no Reference ID                  is passed in then all Ad Hoc Project Transactions will be returned, otherwise only                  the one specified in Reference ID.                                     In WD31, Costing Data was added to Ad Hoc Project Transactions.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Ad_Hoc_Project_Transactions.html", "service": "Revenue_Management"}, {"operation": "Get_Alternate_Contract_Revenue_Allocation_Rules", "description": "This service operation will retrieve Alternate Contract Revenue Allocation Rules.                  Alternate Contract Revenue Allocation Rule Data includes the Revenue Allocation Rule                  Name, Revenue Allocation Rule Notes, Default Revenue Allocation Configuration Line                  Data, and Override Revenue Allocation Configuration Line Data. Default Revenue Allocation                  Configuration Line Data includes Lower Range Percentage, Upper Range Percentage, Revenue                  Allocation Calculation Basis, and Fair Value Price List.  Override Revenue Allocation                  Configuration Line Data contains Override Revenue Allocation Configuration Line ID,                  Override Revenue Allocation Configuration Line, Company, Fair Value Price List, Lower                  Range Percentage, Upper Range Percentage, Revenue Allocation Calculation Basis, and                  Override Revenue Allocation Configuration Line Details Data. Override Revenue Allocation                  Configuration Line Details Data contains  Override Revenue Allocation Configuration                  Line Details ID,  Override Revenue Allocation Configuration Line Details, Sales Item                  Group for FV Price List, Sales Item, Lower Range Percentage, Upper Range Percentage,                  and Revenue Allocation Calculation Basis.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Alternate_Contract_Revenue_Allocation_Rules.html", "service": "Revenue_Management"}, {"operation": "Get_Alternate_Customer_Contracts", "description": "This web service operation will get Alternate Customer Contract. If no Reference ID                  is passed in the all Alternate Customer Contracts will be returned, otherwise only                  the one specified in Reference ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Alternate_Customer_Contracts.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Additional_Data", "description": "Enables retrieval of custom objects for the award.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Additional_Data.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Attachment_Security_Segment", "description": "Retrieves award attachment security segments.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Attachment_Security_Segment.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Credit_Definitions", "description": "This web service operation gets award credit definitions based on request criteria                  or gets all award credit definitions if no request criteria is provided. Award credit                  definition data includes Award Credit Definition Reference, Award Credit Definition                  ID, Award Credit Definition Name, Award Credit Definition Description, Required Worktag                  Type Reference, Optional Worktag Type Reference, Managing Company Reference, and Inactive.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Credit_Definitions.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Groups", "description": "Test Run Award Group Get Task", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Groups.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Lifecycle_Status_Update_Rules", "description": "Gets Award Lifecycle Status Update Rules specified by Award Lifecycle Status Update                  Rule Reference IDs, or if no request ID is provided, all Award Lifecycle Status Update                  Rules. Lifecycle Status Update Rule Data includes Award Lifecycle Status Update Rule,                  Evaluation Order, Applies To Header Status, Applies To Line Status, Change To New                  Status Reference, Unless Current Status Reference, Based On Dates, Based On Award                  Tasks, Number of Months, Number of Days, On or Before Date, On or After Date, Award                  Schedule Life, Award Contract Period, Award Line Life, and Lifecycle Status Update                  Rule Award Task Criteria Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Lifecycle_Status_Update_Rules.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Lifecycle_Statuses", "description": "This service operation will get Award Lifecycle Statuses based on request criteria,                  or all Award Lifecycle Statuses if no request criteria is provided. Award Lifecycle                  Status Data includes Award Lifecycle Status Reference ID, Award Lifecycle Status Name,                  Award Lifecycle Status Valid at Award, Award Lifecycle Status Valid at Award Line,                  Award Lifecycle Status Default at Award, Award Lifecycle Status Default at Award Line,                  and Award Lifecycle Status Inactive.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Lifecycle_Statuses.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Line_Additional_Data", "description": "Enables retrieval of custom objects for the award line.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Line_Additional_Data.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Proposal_Lifecycle_Statuses", "description": "This service operation will get Award Proposal Lifecycle Statuses based on request                  criteria, or all Award Proposal Lifecycle Statuses if no request criteria is provided.                  Award Proposal Lifecycle Status Data includes Award Proposal Lifecycle Status Reference                  ID and Award Proposal Lifecycle Status Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Proposal_Lifecycle_Statuses.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Proposal_Submission_Types", "description": "This service operation will get Award Proposal Submission Types based on request criteria,                  or all Award Proposal Submission Types if no request criteria is provided.  Award                  Proposal Submission Type Data includes Award Proposal Submission Type Reference ID                  and  Award Proposal Submission Type Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Proposal_Submission_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Proposals", "description": "This service operation will get Award Proposals based on request criteria.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Proposals.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Schedules", "description": "This service operation will get Award Schedules based on request criteria, or all                  Award Schedules if no request criteria is provided.  Award Schedule Data includes                  Award Schedule Reference ID, Award Schedule Name, Award Posting Interval Group, and                  Award Year Data.  Award Year Data contains year-by-year information for the award                  schedule, including Award Year Name, Award Year Numer, and Award Period Data.  Award                  Period Data contains information for a single period within an award year, including                  Award Posting Interval Name, Award Period Start Date, and Award Period End Date.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Schedules.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Task_List_Templates", "description": "This service operation will get Award Task List Templates based on specified Award                  Task List Template Reference IDs, or all Award Task List Template if no request ID                  is provided. Award Task List Template Data includes Award Task List Template Reference                  ID, Award Task List Template Name, Recommended for Sponsor Reference, Recommended                  for Award Type Reference, Award Posting Interval Group Reference, and Award Task Template                  Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Task_List_Templates.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Task_Statuses", "description": "Returns Award Task Statuses. The request criteria can be for a single transaction                  based on the Reference ID. If a Reference ID is not specified, the operation retrieves                  all transactions.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Task_Statuses.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Task_Type_Groups", "description": "This service operation will get Award Task Type Groups for the specified criteria.                  Award Task Type Group data includes Award Task Type Group Reference ID, Award Task                  Type Group Name, and Award Task Type Data.  Award Task Type Data includes Award Task                  Type Reference ID, Award Task Type Name, and Award Task Type Is Inactive.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Task_Type_Groups.html", "service": "Revenue_Management"}, {"operation": "Get_Award_Tasks", "description": "Retrieves Award Tasks for the specified request criteria or references. An empty request                  returns all Award Tasks.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Award_Tasks.html", "service": "Revenue_Management"}, {"operation": "Get_Awards", "description": "This service operation will get Awards for the specified criteria. Award data includes                  Award Reference ID, Submit Flag, Locked in Workday Flag, Award Number, Company, Sponsor                  Award Reference Number,  Award Name, Award Description, Effective and Signed Dates,                  Award Type, Purpose Code, Payment Terms, Institutional ID, Related Award, Organizations                  for Award Reference, Sub Award Flag, Sponsor, Flowt Through Sponsor, Bill to Sponsor,                  Payment Type, Letter of Credit, Letter of Credit Document ID, Currency, Sponsor Direct                  Cost, Sponsor Facilities and Administration Amount, Cost Share Total Amount, Authorized                  Amount, Cost Share Required by Sponsor Flag, Anticipated Sponsor Direct Cost Amont,                  Anticipated Facilities and Administration Amount, Award Schedule, CFDA Number, CFDA                  Number Reference, CFDA Description, NSF Code, Proposal ID, Proposal Version, Award                  Notes, Billing Notes, Award Contract Line Data, and Award Attachement Data. Award                  Contract Line Data includes ID, Line Number, Revenue Category, Line Type, Line Description,                  Deferred Revenue Flag, Primary Grant Flag, Grant, Line Amount, Rate Agreement, Cost                  Rate Type, Exception, Revenue Allocation Profile, Basis Limit Data, Start and End                  Dates, Description, Line Invoice Memo Override, Default Worktags, Supplier, Line Billing                  Notes, and Revenue Recognition Line Notes.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Awards.html", "service": "Revenue_Management"}, {"operation": "Get_Bad_Debt_Writeoffs", "description": "This service operation will get Bad Debt Writeoffs for the specified criteria. Bad                  Debt Writeoff data returned includes Writeoff Reference ID, Company ,Customer, Writeoff                  Date, Total Writeoff Amount,                  Invoice or adjustment number, Total Invoice Amount, Amount Due, Writeoff Amount, Writeoff                  Reason, and Worktags. The request criteria can be for a single transaction based on                  Reference.  Otherwise at least one search criteria must be specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Bad_Debt_Writeoffs.html", "service": "Revenue_Management"}, {"operation": "Get_Billing_Schedule_Templates", "description": "This service operation will get Billing Schedule Templates", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Billing_Schedule_Templates.html", "service": "Revenue_Management"}, {"operation": "Get_Billing_Schedules", "description": "This service operation will add or update Billing Schedules and submit to the Billing                  Schedule business process.                    Billing Schedule data includes, but is not limited to Billing Schedule ID, Generate                  Installments flag, Submit flag, Status, Currency, Company, Bill-To Customer, Billing                  Method, Billing Frequency, From Date, To Date, Number of Installments, Use From Date                  flag, Use To Date flag, Day of Month, Schedule Type, Schedule Description, Milestones,                  Schedule On Hold flag, Auto-Submit for Approval, Payment Terms, Payment Type, PO Number,                  Invoice Type, Invoice Memo, Contract Lines, Installment Data.                    Billing Installment Data includes Billing Installment Reference ID, Status, Installment                  Date, Due Date, From Date, To Date, On Hold flag, Amount, Milestone, Override Invoice                  Header flag, Payment Terms, Payment Type, PO Number, Invoice Type, Invoice Memo, Billing                  Installment Line Data.                    Billing Installment Line Data contains Order, Override Line flag, Contract Line, Line                  Item Description, Quantity, UOM, Quantity 2, UOM2, Unit Price, Amount, From Date,                  To Date, Tax Applicability, Tax Code, Deferred Revenue flag, Memo, Worktags.                                     The request criteria can be for a single transaction based on Reference, or all transaction                  can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Billing_Schedules.html", "service": "Revenue_Management"}, {"operation": "Get_Budget_Check_Options_Set", "description": "Retrieves budget check options sets.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Budget_Check_Options_Set.html", "service": "Revenue_Management"}, {"operation": "Get_Business_Connections", "description": "This service operation will get Business Connections based on request criteria, or                  all Business Connections if no request criteria is provided. Business Connection Data                  includes Business Connection Reference ID, the Business Connection owner, customer,                  address, tax code, and inactive and default flags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Business_Connections.html", "service": "Revenue_Management"}, {"operation": "Get_Business_Entity_Contacts", "description": "This service operation will get Get Business Entity Contacts for the specified criteria.                  The data includes the Business Entity Contact ID, the Business Entity the Contact                  is for (Supplier, Customer, Financial Institution or Tax Authority), the Personal                  Data including Name Detail data and Contact Information data.  Name Detail data includes                  formatted Name, Country, Prefix, First Name, Middle Name, Last Name, Secondary Last                  Name, and Name Suffix.  Contact Information data includes Address, Phone, Email, Instance                  Messenger and Web Address data. The request criteria can be for a single transaction                  based on Reference, or all transactions can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Business_Entity_Contacts.html", "service": "Revenue_Management"}, {"operation": "Get_Cash_Sales", "description": "This service operation will get Cash Sales for the specified criteria. Record Cash                  Sale is used to record a sale without an invoice, including the receipt of a payment                  in cash or check.  Cash Sale data includes Cash Sale ID,  Locked in Workday Flag,                  Company, Currency, Customer, Tax Code, Payment Date, Payment Type, Check Number, Record                  Deposit Flag,  Bank Account, Deposit Reference Number,  Memo, Control Total Amount                  and Customer Invoice Line data.  Line data includes Intercompany Affiliate, Sales                  Item, Revenue Category, Quantity, Unit Cost, Extended Amount, Line Memo and Worktags.                  The request criteria can be for a single transaction based on Reference, or all transaction                  can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Cash_Sales.html", "service": "Revenue_Management"}, {"operation": "Get_Catalog_of_Federal_Domestic_Assistance", "description": "Maintain Catalog of Federal Domestic Assistance", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Catalog_of_Federal_Domestic_Assistance.html", "service": "Revenue_Management"}, {"operation": "Get_Companies_as_Business_Entities", "description": "This service operation will get Company as Business Entity instances for the specified                  criteria.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Companies_as_Business_Entities.html", "service": "Revenue_Management"}, {"operation": "Get_Company_Creditor_Identifiers", "description": "This service operation will get Company Creditor Identifiers for Direct Debit mandates.                  Creditor Identifier data Active Indicator, Country, and the text Identifier itself.                  To get the company specific business form layouts, use Get Company Creditor Identifier                  Business Form Layouts.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Company_Creditor_Identifiers.html", "service": "Revenue_Management"}, {"operation": "Get_Consolidated_Invoices", "description": "This service operation will get Consolidated Invoices for the specified criteria.                  Consolidated Invoice data includes Consolidated Invoice ID,  Document Status, Document                  Payment Status,  Company, Customer, Currency, Document Number, Invoice Date, Bill-To                  Address, Bill-To Contact, Payment Type, Payment Terms, Due Date, Memo, Invoice Currency,                  Net Invoice Amount, Tax Amount, Total Invoice Amount, Total Invoice Amount, Withholding                  Tax Amount, Amount Due and Customer Invoice Reference.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Consolidated_Invoices.html", "service": "Revenue_Management"}, {"operation": "Get_Contact_Types", "description": "Retrieves Contact Types for the specified request references or criteria. If neither                  are specified, all Contact Types are returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Contact_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Contract_Amendment_Types", "description": "This Web service operation is used to get contract amendment types.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Contract_Amendment_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Contract_Line_Fees", "description": "Returns Contract Line Fees by Reference ID.                  If no Reference ID or criteria is provided, all Contract Line Fees are returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Contract_Line_Fees.html", "service": "Revenue_Management"}, {"operation": "Get_Contract_Rate_Sheets", "description": "This service operation returns Contract Rate Sheet. Data includes: Contract Rates                  and details of Billing Rate Rule Set.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Contract_Rate_Sheets.html", "service": "Revenue_Management"}, {"operation": "Get_Conversion_Installment_Customer_Invoice_Adjustments", "description": "Retrieves customer invoice adjustments for the automated prepaid award billing installments.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Conversion_Installment_Customer_Invoice_Adjustments.html", "service": "Revenue_Management"}, {"operation": "Get_Cost_Types", "description": "This service operation will get Cost Types for the specified criteria.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Cost_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Credit_Card_Authorization", "description": "This service operation returns Credit Card Authorizations. Data includes: Currency,                  Amount, Merchant Account ID, Merchant Customer Profile, Merchant Processing ID, Reply                  Reason Code, Reply Reason Description, and Credit Card Authorization ID               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Credit_Card_Authorization.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Activity", "description": "This service operation will get Customer Activity for the specified criteria.   The                  Customer Activity web service provides the same information as the on-line Customer                  Activity Detail report.  The data includes Reporting Transaction, Transaction Date,                  Transaction Type, Transaction Number, Invoice Document Due Date, Transaction Addition                  (amount), Transaction Subtraction (amount), Currency, Customer, and Opportunity.                   The request criteria can be for a single transaction based on Reference, or all transaction                  can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Activity.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Categories", "description": "This service operation will get Customer Categories Types for the specified criteria.                  Customer Category includes the Customer Category ID and Customer Category Name.                    Customer categories are used to help determine accounting for transactions beyond                  what is defined in the posting rules. When processing a transaction, Workday finds                  the category on a customer and applies the accounting based on the category. You can                  also use customer categories when selecting or searching for customers. Each customer                  must have one customer category. You assign a customer to a customer categories when                  creating or editing a customer. The request criteria can be for a single transaction                  based on Reference, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Categories.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Amendments", "description": "This service operation will get Customer Contract Amendment for the specified criteria.                  Customer Contract Amendment data includes Customer Contract ID, Submit Flag, Locked                  in Workday Flag, Document Number, Company, Currency, Customer, Effective and Signed                  Dates, Contract Amount, Payment Terms, Payment Type, Hold Flag, PO Number, Salesperson                  and Customer Contract Line data. Line data includes Sales Item, Revenue Category,                  Quantity, Unit Cost, for Fixed and Transaction-Based Price Types, and Recurring Installment                  Attributes for Recurring Price Type, and Worktags. The request criteria can be for                  a single transaction based on Reference or Contract Number, or all transaction can                  be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Amendments.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Checklist_Templates", "description": "Returns Customer Contract Checklist Templates by Reference ID, or returns all Customer                  Contract Checklist Templates if no Reference ID is provided.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Checklist_Templates.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Discount_and_Premium", "description": "This service operation will get Discounts/Premiums for the specified criteria", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Discount_and_Premium.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Renewal_Terms", "description": "This service operation will get all contract line renewals for a request criteria.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Renewal_Terms.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Templates", "description": "This service operation will get Customer Contract Templates for the specified criteria.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Templates.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contract_Types", "description": "This Web service operation is used to get customer contract types.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contract_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Contracts", "description": "This service operation will get Customer Contracts for the specified criteria.   Customer                  Invoice data includes Customer Contract ID, Submit Flag, Locked in Workday Flag, Document                  Number, Company, Currency, Customer, Effective and Signed Dates, Contract Amount,                  Payment Terms, Payment Type, Hold  Flag, PO Number, Salesperson and Customer Contract                  Line data.  Line data includes  Sales Item, Revenue Category, Quantity, Unit Cost,                  for Fixed and Transaction-Based Price Types, and Recurring Installment Attributes                  for Recurring Price Type, and Worktags.  The request criteria can be for a single                  transaction based on Reference or Contract Number, or all transaction can be retrieved                  if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Contracts.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Date_Milestones", "description": "this service provides the ability to get Customer Date Milestones already defined                  in the system.  Get will retrieve  Customer, Customer Date Milestone Type, Customer                  Milestone Name, Estimated Completion Date,  Completed boolean, Completed on Date,                  and Comments               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Date_Milestones.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Deposits", "description": "Public web service to retrieve Customer Deposits from Workday.  Allows selection criteria                  of: Customer Deposit by Reference, Company, Customer, Customer Hierarchy, Customer                  Status, Bank Account, Payment Date Range, Deposit Reference Number, Deposit Status,                  Reconciliation Status and Created by Worker. Data contains: Locked in Workday, Company,                  Currency, Payment Deposit Date, Bank Account, Deposit Reference Number, Control Total                  Amount, Currency Rate Type, Currency Rate Override, Electronic File Information and                  references to Customer Payments in Workday.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Deposits.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Groups", "description": "This service operation will get Customer Groups for the specified criteria.  Customer                  Groups are used for reporting and selection. Customer groups can include individual                  Customers. Customer Group data includes Customer Group ID and Name. The request criteria                  can be for a single transaction based on Reference, or all transaction can be retrieved                  if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Groups.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Invoice_Adjustments", "description": "This service operation will get Customer Invoice Adjustments for the specified criteria.                  Customer Invoice Adjustment data includes Customer Invoice Adjustment ID, Submit Flag,                  Locked in Workday Flag, Document Number, Company, Currency, Customer, Increase Amount                  Flag, Adjustment Reason, Adjustment Date, Due Date Override, Control Total Amount,                  Original Invoice, Payment Terms, Hold from Payment Flag,  PO Number, Contract, Memo,                  Attachment and Customer Invoice Line data.  Line data includes Intercompany Affiliate,                  Sales Item, Revenue Category, Quantity, Unit Cost, Extended Amount, Line Memo and                  Worktags.  The request criteria can be for a single transaction based on Reference,                  or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Invoice_Adjustments.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Invoices", "description": "This service operation will get Customer Invoices for the specified criteria. Customer                  Invoice data includes Customer Invoice ID, Submit Flag, Locked in Workday Flag, Document                  Number, Company, Currency, Customer, Document Date, Due Date Override, Control Total                  Amount, Payment Terms, Hold from Payment Flag, Document Received, Reference, PO Number,                  Memo, Attachment and Customer Invoice Line data. Line data includes Intercompany Affiliate,                  Sales Item, Revenue Category, Quantity, Unit Cost, Extended Amount, Line Memo and                  Worktags. The request criteria can be for a single transaction based on Reference,                  or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Invoices.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Payments", "description": "Public Web Service to retrieve Customer Payments from Workday. Selection Criteria                  includes:  Company or Company Hierarchy, Remit-from Customer, Customer Status, Payment                  Type, Payment Date Range, Created by Worker, and Intercompany Transaction. Data contains:                  Locked in Workday, Company, Currency, Payment Date, Payment Type, Payment Amount,                  Remit-from Customer, Check Number, Payment Memo, Ready to Auto-Apply, Do Not Apply                  Payment to Invoices on Hold, Electronic File Information, Customer Payment Remittance                  Advice, and reference to an existing Customer Deposit.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Payments.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Portal_Payment_Session", "description": "This service operation retrieves existing Customer Portal Payment Session for the                  criteria specified in the request. The response data includes Session ID, Merchant                  Account ID, Payment Amount Requested, Payment Amount Actual, Currency Reference, Payment                  Session Timeout Timestamp, and Customer Invoice data. If the flag for Exclude Customer                  Invoice Data is true, then you will not get any invoice data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Portal_Payment_Session.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Refund_Documents", "description": "Get Customer Refund Documents", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Refund_Documents.html", "service": "Revenue_Management"}, {"operation": "Get_Customer_Refunds", "isDeprecated": true, "description": "DEPRECATED: This web service operation is deprecated in v36.0.  Please use Get Customer                  Refund Documents web service operation instead.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customer_Refunds.html", "service": "Revenue_Management"}, {"operation": "Get_Customers", "description": "This service operation will get Customers for the specified criteria.  Customer data                  includes Customer ID, Customer Reference ID, Customer Name, Customer Category, Customer                  Group, Payment Terms, default Payment Terms, Tax Code, Lock Box, Business Entity data,                  Settlement Account data, Customer Status data, Always Separate Payments Flag, Business                  Entity Alternate Name Data, Business Entity Attachment data.   Business Entity data                  includes Name, Tax ID, External ID, Contact Information data, and Business Entity                  Logo.  Contact Information data includes Address, Phone, Email, Instant Messenger                  and Web Address data.  The request criteria can be for a single transaction based                  on Reference, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Customers.html", "service": "Revenue_Management"}, {"operation": "Get_Daily_Rate_Transaction_Groupings", "description": "This web service operation will get Daily Rate Transaction Groupings.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Daily_Rate_Transaction_Groupings.html", "service": "Revenue_Management"}, {"operation": "Get_Deferred_Cost_Schedules", "description": "Returns Deferred Cost Schedules by Reference ID.                  If no Reference ID or criteria is provided, all Deferred Cost Schedules are returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Deferred_Cost_Schedules.html", "service": "Revenue_Management"}, {"operation": "Get_Deferred_Cost_Transactions", "description": "This service operation gets Deferred Cost Transactions based on request criteria (all                  transactions is not an option). Deferred Cost Transaction Data includes Deferred Cost                  Transaction Reference ID, transaction date, customer, description, cost type,amount,                  currency, notes and worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Deferred_Cost_Transactions.html", "service": "Revenue_Management"}, {"operation": "Get_Dunning_Level_Groups", "description": "This web service operation returns dunning level groups.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Dunning_Level_Groups.html", "service": "Revenue_Management"}, {"operation": "Get_Electronic_Invoicing_Acknowledgements", "description": "This service operation will get Electronic Invoicing Acknowledgements for the specified                  criteria. Electronic Invoicing Acknowledgement data includes Electronic Invoicing                  Acknowledgment ID,  Customer Invoice Document, Date, Status, and Message.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Electronic_Invoicing_Acknowledgements.html", "service": "Revenue_Management"}, {"operation": "Get_External_Workers", "description": "This service operation will get External Workers based on request criteria, or all                  External Workers if no request criteria is provided.  External Worker Data includes                  External Worker Reference ID and External Worker Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_External_Workers.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Admin_Cost_Rate_Type_Types", "description": "Web service for retrieving Type of Facilities and Admin Cost Rate Types. Facilities                  and Admin Cost Rate Type Types are used for identifying Cost Rate Snapshot Shots and                  whether they are for example \"Provisional,\" \"Final\" etc.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Admin_Cost_Rate_Type_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Basis_Types", "description": "Retrieves Basis Types for the specified request criteria or references. An empty request                  returns all Basis Types.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Basis_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Exceptions", "description": "This service operation retrieves Facilities and Administration Exceptions instances.                  The response includes the Facilities and Administration Exception, primary rate override,                  and override rates for the respective object class.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Exceptions.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Object_Class_Mappings", "description": "Make Get Object Class Mapping WS Public. A power user should be able to upload my                  object class mapping via an EIB.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Object_Class_Mappings.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Rate_Agreements", "description": "Web Service in retrieving Facilities and Administration Rate Agreements", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Rate_Agreements.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Revenue_Allocation_Profiles", "description": "This web service operation retrieves facilities and administration revenue allocation                  profiles, including profile ID, profile name, cost share, revenue distribution percent,                  worktag type reference, and worktag reference.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Revenue_Allocation_Profiles.html", "service": "Revenue_Management"}, {"operation": "Get_Facilities_and_Administration_Waived_Expense_Allocation_Profiles", "description": "This service operation will get Facilities and Administration Waived Expense Allocation                  Profiles which may be used on Facilities and Administration Exceptions on Awards.                  Facilities and Administration Waived Expense Allocation Profile data includes ID,                  Name, and Facilities and Administration Waived Expense Distribution Data.  Facilities                  and Administration Waived Expense Distribution Data includes Allocation Distribution                  percent and Facilities and Administration Waived Expense Worktag Offest Override Data.                  Facilities and Administration Waived Expense Worktag Offset Override Data includes                  Accounting Worktag Type and Worktag. The request criteria can be for a single Allocation                  Profile based on Reference, or all Allocation Profiles can be retrieved if no criteria                  is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Facilities_and_Administration_Waived_Expense_Allocation_Profiles.html", "service": "Revenue_Management"}, {"operation": "Get_Grants_Management_Configuration", "description": "Retrieves all Grants Management configurations. Data retrieved includes Default Line                  Type and Valid Line Types for general configurations. We also retrieve Reference ID                  and Company for company level configurations.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Grants_Management_Configuration.html", "service": "Revenue_Management"}, {"operation": "Get_Hold_Reasons", "description": "This service operation will get Hold Reasons for the specified criteria.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Hold_Reasons.html", "service": "Revenue_Management"}, {"operation": "Get_Intercompany_Contract_Billing_Schedules", "description": "This web service operation will retrieve Billing Schedules for intercompany customer                  contracts. The request criteria can be for a single transaction based on Reference,                  or all transaction can be retrieved if no criteria is specified.                  Intercompany Contract Billing Schedule Data includes, but is not limited to Billing                  Schedule ID, Submit flag, Status, Currency, Company, Bill-To Customer, Bill-To Company,                  Bill-To Contact, Billing Method, Billing Frequency, Schedule Description, Schedule                  On Hold flag, Auto-Submit for Approval, Payment Terms, Payment Type, PO Number, Invoice                  Type, Invoice Memo, and Intercompany Customer Contract Lines.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Intercompany_Contract_Billing_Schedules.html", "service": "Revenue_Management"}, {"operation": "Get_Intercompany_Customer_Contract", "description": "Retrieves the Intercompany Contract by request reference and by Customer and Company.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Intercompany_Customer_Contract.html", "service": "Revenue_Management"}, {"operation": "Get_Merchant_Customer_Profile", "description": "Service operation to retrieve Merchant Customer Profiles.  Returns Customer Reference,                  Customer Information, Primary Card, Merchant Account Reference, Merchant Account ID,                  Credit Card Type Reference, First Name, Last Name, Expiration Date, Last 4 Digits                  of Credit Card Number, Merchant Processing ID, Reply Reason Code, Reply Reason Description,                  and Customer Profile ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Merchant_Customer_Profile.html", "service": "Revenue_Management"}, {"operation": "Get_Netting_Transactions", "description": "This service operation will get Netting Transactions for the specified criteria.                   Netting Transaction data includes Netting Transaction ID, Submit Flag, Company, Currency,                  Netting Rule, Netting Transaction Date, Supplier Invoice Date on or after Date, Supplier                  Invoice Date on or before Date, Customer Invoice Date on or after Date, Customer Invoice                  Date on or before Date, Attachment, Supplier Invoice Line Data and Customer Invoice                  Line Data.  Supplier Invoice Line Data includes Supplier Invoice ID, Amount to Net,                  and Amount Netted.  Customer Invoice Line Data includes Customer Invoice ID, Amount                  to Net and Amount Netted.  The request criteria can be for a single transaction based                  on Reference, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Netting_Transactions.html", "service": "Revenue_Management"}, {"operation": "Get_Opportunities", "description": "This service operation will get Opportunities for the specified criteria.   The request                  criteria can be for a single transaction based on Reference, or all transaction can                  be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Opportunities.html", "service": "Revenue_Management"}, {"operation": "Get_Order_Fulfillment_Transactions", "description": "This service operation will get Order Fulfillment Transactions based on request reference                  or request criteria (Customer or Customer Contracts, Transaction Start Date and Transaction                  End Date). Order Fulfillment Transaction Data includes Order Fulfillment Transaction                  Reference ID, Fulfillment date, quantity fulfilled, Customer, Company, Customer Contract                  line, Ship to customer and Ship to address.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Order_Fulfillment_Transactions.html", "service": "Revenue_Management"}, {"operation": "Get_Percent_Complete_Configurations", "description": "This web service operation will get Percent Complete Configurations. Configurations                  can be retrieved by Name, Company, Project Hierarchy, or Project. If no criteria is                  passed in, all Percent Complete Configurations will be returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Percent_Complete_Configurations.html", "service": "Revenue_Management"}, {"operation": "Get_Percent_Complete_for_Revenue", "description": "This service operation returns details about Percent Complete for Project.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Percent_Complete_for_Revenue.html", "service": "Revenue_Management"}, {"operation": "Get_Project_Billing_Rate_Sheet_Configuration_Lines", "description": "This web service operation will get Project Billing Rate Sheet Configuration Lines.                  If no Reference ID is passed in then all Project Billing Rate Sheet Configuration                  Lines will be returned, otherwise only the one specified in Reference ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Project_Billing_Rate_Sheet_Configuration_Lines.html", "service": "Revenue_Management"}, {"operation": "Get_Project_Billing_Rate_Sheets", "description": "For Project Billing Rate Sheets", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Project_Billing_Rate_Sheets.html", "service": "Revenue_Management"}, {"operation": "Get_Project_Rate_Categories", "description": "Service to get Project Rate Categories and Project Rate Category Members", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Project_Rate_Categories.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Adjustment_Reasons", "description": "Returns Revenue Adjustment Reasons by Reference ID, or returns all Revenue Adjustment                  Reasons if no Reference ID is provided.” If there are search criteria, add those criteria                  to the description. For example, “Returns Revenue Adjustment Reason by Reference ID.                  Returns all Revenue Adjustment Reasons if no Reference ID or criteria is provided.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Adjustment_Reasons.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Allocation_Configurations", "description": "This service operation will retrieve the Tenant's Revenue Allocation Configuration.                  Revenue Allocation Configuration Data includes Allocation in Summary, efault Revenue                  Allocation Configuration Line Data, and Override Revenue Allocation Configuration                  Line Data. Default Revenue Allocation Configuration Line Data includes Lower Range                  Percentage, Upper Range Percentage, Revenue Allocation Calculation Basis, and Fair                  Value Price List.  Override Revenue Allocation Configuration Line Data contains Override                  Revenue Allocation Configuration Line ID, Override Revenue Allocation Configuration                  Line, Company, Fair Value Price List, Lower Range Percentage, Upper Range Percentage,                  Revenue Allocation Calculation Basis, and Override Revenue Allocation Configuration                  Line Details Data. Override Revenue Allocation Configuration Line Details Data contains                  Override Revenue Allocation Configuration Line Details ID,  Override Revenue Allocation                  Configuration Line Details, Sales Item Group for FV Price List, Sales Item, Lower                  Range Percentage, Upper Range Percentage, and Revenue Allocation Calculation Basis.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Allocation_Configurations.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Categories", "description": "This service operation will get Revenue Categories for the specified criteria. Revenue                  Category data includes Revenue Category ID, Name and Tax Applicability.  The request                  criteria can be for a single transaction based on Reference, or all transaction can                  be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Categories.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Category_Hierarchies", "description": "Returns Revenue Category Hierarchies according to its reference id, name, or all of                  them should no search criteria be provided.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Category_Hierarchies.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Recognition_Schedule_Templates", "description": "This service operation will add or update Revenue Recognition Schedule Templates", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Recognition_Schedule_Templates.html", "service": "Revenue_Management"}, {"operation": "Get_Revenue_Recognition_Schedules", "description": "This service operation will get Revenue Recognition Schedules.                    Revenue Recognition Schedule data includes, but is not limited to Revenue Recognition                  Schedule ID, Generate Installments flag, Submit flag, Status, Currency, Company, Customer,                  Amount Distribution Method, Frequency, From Date, To Date, Number of Installments,                  Schedule Type, Schedule Description, Milestones, Schedule On Hold flag, Contract Lines,                  Installment Data.                    Revenue Recognition Installment Data includes Revenue Recognition Installment Reference                  ID, Status, Installment Date, From Date, To Date, On Hold flag, Amount, Currency,                  Milestones, Revenue Recognition Installment Line Data.                    Revenue Recognition Installment Line Data contains Contract Line, Revenue Category,                  Sales Item, Line Item Description, Worktags, From Date, To Date, Amount.                                     The request criteria can be for a single transaction based on Reference, or all transaction                  can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Revenue_Recognition_Schedules.html", "service": "Revenue_Management"}, {"operation": "Get_Salary_Caps", "description": "This service operation will get award salary cap for the specified criteria.Award                  Salary Cap Data includes Award Salary Cap Reference ID, Award Limit Name, Award Limit                  Snapshot Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Salary_Caps.html", "service": "Revenue_Management"}, {"operation": "Get_Salary_Over_The_Cap_Types", "description": "Retrieves Salary Over The Cap Type. Used in the Salary Cap definition as a worktag                  and is passed to payroll to calculate payroll amounts exceeding the Salary Cap.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Salary_Over_The_Cap_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Sales_Item_Fair_Value_Price_Lists", "description": "This web service operation will get Sales Item Fair Value Price Lists. If no Reference                  ID is passed in the all Sales Items Fair Value Price Lists will be returned, otherwise                  only the one specified in Reference ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Sales_Item_Fair_Value_Price_Lists.html", "service": "Revenue_Management"}, {"operation": "Get_Sales_Item_Groups", "description": "This service operation will get Sales Item Groups for the specified criteria.  Assign                  sales items to sales item groups to make it easier to search for and select items.                  Items can belong to multiple groups. Sales Item Group data includes Sales Item Group                  ID and Name.  The request criteria can be for a single transaction based on Reference,                  or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Sales_Item_Groups.html", "service": "Revenue_Management"}, {"operation": "Get_Sales_Item_Price_Lists", "description": "This web service operation will get Sales Item Price Lists. If no Reference ID is                  passed in the all Sales Items Price Lists will be returned, otherwise only the one                  specified in Reference ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Sales_Item_Price_Lists.html", "service": "Revenue_Management"}, {"operation": "Get_Sales_Items", "description": "This service operation will add or update Sales Items. Sales items are goods and services                  which a company sells.  Sales Item data includes  Sales Item ID, Item Name, Revenue                  Category, Item Description, Item Identifier, Unit of Measure, Unit Price, Currency,                  Tax Applicability, Sales Item Group. The request criteria can be for a single transaction                  based on Reference, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Sales_Items.html", "service": "Revenue_Management"}, {"operation": "Get_Special_Condition_Types", "description": "Retrieves the special condition types for a sponsor.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Special_Condition_Types.html", "service": "Revenue_Management"}, {"operation": "Get_Sponsors", "description": "This service operation will get Sponsors for the specified criteria.  Sponsor data                  includes Sponsor ID, Sponsor Reference ID, Sponsor Name, Sponsor Type, Payment Terms,                  default Payment Type, Business Entity data, Settlement Account data, Customer Status                  data, Remit-From Sponsor, default Currency, Accepted Currencies, Business Entity Alternate                  Name Data, Business Entity Attachment data.   Business Entity data includes Name,                  Tax ID, External ID, Contact Information data, and Business Entity Logo.  Contact                  Information data includes Address, Phone, Email, Instant Messenger and Web Address                  data.  The request criteria can be for a single transaction based on Reference, or                  all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Sponsors.html", "service": "Revenue_Management"}, {"operation": "Get_Subaward_Risk_Assessments", "description": "This service operation will get subaward risk assessments for the specified criteria.                  Subaward Risk Assessment data includes Subaward Risk Assessment Reference, Subaward                  Reference, Start Date, End Date, Evaluation Date,  Risk Evaluation Level Reference,                  Comment, Attachment Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Subaward_Risk_Assessments.html", "service": "Revenue_Management"}, {"operation": "Get_Subawards", "description": "This service operation will get Subawards for the specified requested references.                  If none are specified, all Subawards are returned.  Subaward data includes Subaward                  Reference, Award Contract Reference, Award Contract Line Reference, Subrecipient Reference,                  Location Reference, Subject to FFATA Reference, Attachment Data, and Subaward Contact                  Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Subawards.html", "service": "Revenue_Management"}, {"operation": "Get_Subrecipient_Risk_Records", "description": "Retrieves Subrecipient Risk Records for the specified request references or criteria.                  If neither are specified, all Subrecipient Risk Records are returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Subrecipient_Risk_Records.html", "service": "Revenue_Management"}, {"operation": "Get_Subrecipients", "description": "Retrieves Subrecipients for the specified request references or criteria. If neither                  are specified, all Subrecipients are returned.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Subrecipients.html", "service": "Revenue_Management"}, {"operation": "Get_Usage_Based_Transactions", "description": "This service operation will get Usage Based Transactions based on request criteria                  (all transactions is not an option). Usage Based Transaction Data includes Usage Based                  Transaction Reference ID, transaction date, quantity, unit of measure, location data                  (country, country region, city, postal code), description, calculated transaction                  rate, and amount to bill.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Usage_Based_Transactions.html", "service": "Revenue_Management"}, {"operation": "Get_Usage_Billing_Rates", "description": "This service operation will get Usage Billing Rates.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Usage_Billing_Rates.html", "service": "Revenue_Management"}, {"operation": "Get_Worker_Billing_Rates", "description": "This web service can be used to retrieve worker billing rate data.  Data can be retrieved                  by providing one or more worker billing rate references.  Alternatively, data can                  be retrieved by providing one or more worker references.  Leave the Request References                  and Request criteria null to retrieve all data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Worker_Billing_Rates.html", "service": "Revenue_Management"}, {"operation": "Get_Worker_Rule_Billing_Rates", "description": "Returns Worker Rule Billing Rate[plural] by Reference ID, or returns all Worker Rule                  Billing Rate[plural] if no Reference ID is provided.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Get_Worker_Rule_Billing_Rates.html", "service": "Revenue_Management"}, {"operation": "Import_Customer_Invoice", "description": "This service operation will add or update Customer Invoices and submit to the Customer                  Invoice business process. Ideal for Customer Invoices with many lines. Customer Invoice                  data includes Customer Invoice ID, Submit Flag, Locked in Workday Flag, Document Number,                  Company, Currency, Customer, Document Date, Due Date Override, Control Total Amount,                  Payment Terms, Hold from Payment Flag, Document Received, Reference, PO Number, Memo,                  Attachment and Customer Invoice Line data. Line data includes Intercompany Affiliate,                  Sales Item, Revenue Category, Quantity, Unit Cost, Extended Amount, Line Memo and                  Worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Import_Customer_Invoice.html", "service": "Revenue_Management"}, {"operation": "Import_Worker_Billing_Rates", "description": "Web Service to load billing rates for workers.  This runs as a background process                  to support large loads.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Import_Worker_Billing_Rates.html", "service": "Revenue_Management"}, {"operation": "Put_Ad_Hoc_Project_Transaction", "description": "Creates a new Ad Hoc Project Transaction (or updates an existing Ad Hoc Project Transaction)                  with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Ad_Hoc_Project_Transaction.html", "service": "Revenue_Management"}, {"operation": "Put_Ad_Hoc_Project_Transaction_Custom_Reference", "description": "Updates Ad Hoc Project Transaction Custom Reference with the information supplied                  in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Ad_Hoc_Project_Transaction_Custom_Reference.html", "service": "Revenue_Management"}, {"operation": "Put_Alternate_Contract_Revenue_Allocation_Rule", "description": "This service operation will add or update an Alternate Contract Revenue Allocation                  Rule. An Alternate Contract Revenue Allocation Rule Data includes Revenue Allocation                  Scenario Reference ID, Scenario Configuration Name, Scenario Configuration Description,                  Default Revenue Allocation Configuration Line Data, and Override Revenue Allocation                  Configuration Line Data. Default Revenue Allocation Configuration Line Data includes                  Lower Range Percentage, Upper Range Percentage, Revenue Allocation Calculation Basis,                  and Fair Value Price List.  Override Revenue Allocation Configuration Line Data contains                  Override Revenue Allocation Configuration Line ID, Override Revenue Allocation Configuration                  Line, Company, Fair Value Price List, Lower Range Percentage, Upper Range Percentage,                  Revenue Allocation Calculation Basis, and Override Revenue Allocation Configuration                  Line Details Data. Override Revenue Allocation Configuration Line Details Data contains                  Override Revenue Allocation Configuration Line Details ID,  Override Revenue Allocation                  Configuration Line Details, Sales Item Group for FV Price List, Sales Item, Lower                  Range Percentage, Upper Range Percentage, and Revenue Allocation Calculation Basis.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Alternate_Contract_Revenue_Allocation_Rule.html", "service": "Revenue_Management"}, {"operation": "Put_Alternate_Customer_Contract", "description": "Creates a new Alternate Customer Contract (or updates an existing Alternate Customer                  Contract) with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Alternate_Customer_Contract.html", "service": "Revenue_Management"}, {"operation": "Put_Approved_Customer_Invoice", "description": "This service operation will update approved Customer Invoices PO number.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Approved_Customer_Invoice.html", "service": "Revenue_Management"}, {"operation": "Put_Approved_Customer_Invoice_Adjustment", "description": "This service operation will update approved Customer Invoices Adjustment PO number.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Approved_Customer_Invoice_Adjustment.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Additional_Data", "description": "Enables updating of custom objects for awards.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Additional_Data.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Attachment_Security_Segment", "description": "Adds or updates an award attachment security segment.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Attachment_Security_Segment.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Credit_Definition", "description": "This web service operation adds or updates award credit definitions. Award credit                  definition data includes Award Credit Definition Reference, Award Credit Definition                  ID, Award Credit Definition Name, Award Credit Definition Description, Required Worktag                  Type Reference, Optional Worktag Type Reference, Managing Company Reference, and Inactive.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Credit_Definition.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Group", "description": "Web Service Task to Create/Edit Award Groups", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Group.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Lifecycle_Status", "description": "This service operation will add or update Award Lifecycle Statuses. Award Lifecycle                  Status Data includes Award Lifecycle Status Reference ID, Award Lifecycle Status Name,                  Award Lifecycle Status Valid at Award, Award Lifecycle Status Valid at Award Line,                  Award Lifecycle Status Default at Award, Award Lifecycle Status Default at Award Line,                  and Award Lifecycle Status Inactive.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Lifecycle_Status.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Lifecycle_Status_Update_Rule", "description": "Adds or updates Award Lifecycle Status Update Rule. Lifecycle Status Update Rule Data                  includes Award Lifecycle Status Update Rule ID, Evaluation Order, Applies To Header                  Status, Applies To Line Status, Change To New Status Reference, Unless Current Status                  Reference, Based On Dates, Based On Award Tasks, Number of Months, Number of Days,                  On or Before Date, On or After Date, Award Schedule Life, Award Contract Period, Award                  Line Life and Lifecycle Status Update Rule Award Task Criteria Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Lifecycle_Status_Update_Rule.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Line_Additional_Data", "description": "Enables updating of custom objects for award lines.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Line_Additional_Data.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Proposal_Lifecycle_Status", "description": "This service operation will add or update Award Proposal Lifecycle Statuses. Award                  Proposal Lifecycle Status Data includes Award Proposal Lifecycle Status Reference                  ID, Award Proposal Lifecycle Status Name, and Award Proposal Lifecycle Status Inactive                  status.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Proposal_Lifecycle_Status.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Proposal_Submission_Type", "description": "This service operation will add or update Award Proposal Submission Types.  Award                  Proposal Submission Type Data includes Award Proposal Submission Type Reference ID,                  Award Proposal Submission Type Name, and Award Proposal Submission Type Inactive status.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Proposal_Submission_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Schedule", "description": "This service operation will add or update Award Schedules for use on Award Contracts.                  Award Schedule Data includes Award Schedule Reference ID, Award Schedule Name, Award                  Posting Interval Group, and Award Year Data.  Award Year Data contains year-by-year                  information for the award schedule, including Award Year Name, Award Year Numer, and                  Award Period Data.  Award Period Data contains information for a single period within                  an award year, including Award Posting Interval Name, Award Period Start Date, and                  Award Period End Date.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Schedule.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Task", "description": "Creates, updates, or deletes a single Award Task.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Task.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Task_List_Template", "description": "This service operation will add or update Award Task List Template. Award Task List                  Template Data includes Award Task List Template Reference ID, Award Task List Template                  Name, Recommended for Sponsor Reference, Recommended for Award Type Reference, Award                  Posting Interval Group Reference, and Award Task Template Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Task_List_Template.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Task_Status", "description": "Adds or updates Award Task Status. Status data includes a Status Name, ID, Default                  Award Task Status flag, Status Indicates done flag, Status is Inactive flag. The operation                  also gives you the ability to change the order of a Award Task Status.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Task_Status.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Task_Type_Group", "description": "This service operation will add or update Award Task Type Groups.  Award Task Type                  Group data includes Award Task Type Group Reference ID, Award Task Type Group Name,                  and Award Task Type Data. Award Task TypeData includes Award Task Type Reference ID,                  Award Task Type Name, and Award Task Type Is Inactive flag.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Task_Type_Group.html", "service": "Revenue_Management"}, {"operation": "Put_Award_Tasks_for_Award", "description": "Creates, updates, and deletes Award Tasks for an Award.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Award_Tasks_for_Award.html", "service": "Revenue_Management"}, {"operation": "Put_Billing_Schedule_Template", "description": "This service operation will add or update Billing Schedule Templates", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Billing_Schedule_Template.html", "service": "Revenue_Management"}, {"operation": "Put_Budget_Check_Options_Set", "description": "Adds or updates a budget check options set.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Budget_Check_Options_Set.html", "service": "Revenue_Management"}, {"operation": "Put_Business_Connection", "description": "This service operation will add or update Business Connections. Business Connection                  Data includes Business Connection Reference ID, the Business Connection owner, customer,                  address, tax code, and inactive and default flags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Business_Connection.html", "service": "Revenue_Management"}, {"operation": "Put_Business_Entity_Contact", "description": "This service operation will add or update Business Entity Contacts.  The data includes                  the Business Entity Contact ID, the Business Entity the Contact is for (Supplier,                  Customer, Financial Institution or Tax Authority), the Personal Data including Name                  Detail data and Contact Information data.  Name Detail data includes formatted Name,                  Country, Prefix, First Name, Middle Name, Last Name, Secondary Last Name, and Name                  Suffix.  Contact Information data includes Address, Phone, Email, Instance Messenger                  and Web Address data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Business_Entity_Contact.html", "service": "Revenue_Management"}, {"operation": "Put_Catalog_of_Federal_Domestic_Assistance", "description": "Maintain Catalog of Federal Domestic Assistance", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Catalog_of_Federal_Domestic_Assistance.html", "service": "Revenue_Management"}, {"operation": "Put_Company_Creditor_Identifier", "description": "This is the put task to update Company Creditor Identifiers from a grid that the customer                  will send via Web Services. To update the company specific business form layouts,                  use Put Company Creditor Identifier Business Form Layouts.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Company_Creditor_Identifier.html", "service": "Revenue_Management"}, {"operation": "Put_Company_as_Business_Entity", "description": "This service operation will submit company as business entity.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Company_as_Business_Entity.html", "service": "Revenue_Management"}, {"operation": "Put_Consolidated_Invoice", "description": "Creates a new Consolidated Invoice with the information supplied in the request.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Consolidated_Invoice.html", "service": "Revenue_Management"}, {"operation": "Put_Contact_Type", "description": "This service operation will add or update Contact Types. Contact Type Data includes                  Contact Type Reference ID, Name, Business Entity Contact Type Reference, and Inactive                  flag.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Contact_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Contract_Amendment_Type", "description": "This web service operation is used to add, update, and delete contract amendment type.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Contract_Amendment_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Contract_Line_Fee", "description": "This service operation will add or update Contract Line Fees.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Contract_Line_Fee.html", "service": "Revenue_Management"}, {"operation": "Put_Conversion_Installment_Customer_Invoice_Adjustment", "description": "Updates a customer invoice adjustment to exclude its amount from the automated prepaid                  award billing calculations.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Conversion_Installment_Customer_Invoice_Adjustment.html", "service": "Revenue_Management"}, {"operation": "Put_Cost_Type", "description": "This service operation will add or update Cost Types.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Cost_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Credit_Card_Authorization", "description": "This service operation updates Credit Card Authorizations. Data includes: Currency,                  Amount, Merchant Account ID, Merchant Customer Profile, Merchant Processing ID, Reply                  Reason Code, Reply Reason Description, and Credit Card Authorization ID               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Credit_Card_Authorization.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Category", "description": "This service operation will add or update Customer Category.  Customer Category includes                  the Customer Category ID and Customer Category Name.   Customer categories are used                  to help determine accounting for transactions beyond what is defined in the posting                  rules. When processing a transaction, Workday finds the category on a customer and                  applies the accounting based on the category. You can't override this category for                  individual transactions.  You can also use customer categories when selecting or searching                  for customers. Each customer must have one customer category. You assign a customer                  to customer categories when creating or editing a customer.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Category.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Contract_Checklist_Template", "description": "Creates a new Customer Contract Checklist Template (or updates an existing Customer                  Contract Checklist Template) with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Contract_Checklist_Template.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Contract_Discount_and_Premium", "description": "This service operation will add or update Contract Discounts and Premiums. These are                  used to adjust values on Contract Lines.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Contract_Discount_and_Premium.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Contract_Renewal_Terms", "description": "This service operation will add or update contract line renewals for contract lines.                  Renewal data includes Contract Line Reference, Renewal Rate Amount, Renewal Percent,                  Unit Cost, Quantity, Quantity2, Renewal Start Date, Renewal End Date, Co-Terminate,                  Auto Renewal, Opt-Out Period and Renewal Comment. The request criteria can be for                  a one or more renewals based contract line reference.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Contract_Renewal_Terms.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Contract_Template", "description": "This service operation will add or update Customer Contract Templates.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Contract_Template.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Contract_Type", "description": "This web service operation is used to add, update, and delete customer contract type.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Contract_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Date_Milestone", "description": "This service operation will add or update Customer Date Milestone. Customer Date Milestone                  includes the Customer Milestone ID, Customer, Customer Date Milestone Name, Customer                  Date Milestone Type, Estimated Completion Date, Completed Flag, Completed on date,                  and Comments               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Date_Milestone.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Group", "description": "This service operation will add or update Customer Groups.  Customer Groups are used                  for reporting and selection. Customer groups can include individual Customers. Customer                  Group data includes Customer Group ID and Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Group.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Invoice_Adjustment_Collection_Information", "description": "Customer Invoice Adjustment to add Notes to a Customer Invoice", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Invoice_Adjustment_Collection_Information.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Invoice_Collection_Information", "description": "This web service gives the user the ability to add Notes, Disputes, and Collections                  to an invoice.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Invoice_Collection_Information.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Payment", "description": "This service operation will Record a Customer Payment. Record Customer Payment is                  used to enter Customer Payment data into the system to be applied to Customer Invoices                  either automatically or manually. Customer Payment Data includes the Customer Payment                  for Invoices ID,  Locked in Workday Flag, Company, Currency, Payment Date, Payment                  Type, Payment Amount, Remit-from Customer, Check Number,  Payment Memo, Ready to Auto-Apply                  Flag (if flagged for auto-apply, Do Not Apply Payment to Invoices on Hold, Remit-from                  Customer must be included), Electronic File Information, Reference to an existing                  Customer Deposit and Customer Payment Remittance Advice Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Payment.html", "service": "Revenue_Management"}, {"operation": "Put_Customer_Portal_Payment_Session", "description": "This service operation updates existing Customer Portal Payment Session referenced                  in the request. The request data includes Payment Amount Actual, External Payment                  Record, External Payment Response Text and Payment Session Timeout Timestamp.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Customer_Portal_Payment_Session.html", "service": "Revenue_Management"}, {"operation": "Put_Daily_Rate_Transaction_Grouping", "description": "This service operation will add or update a Daily Rate Transaction Grouping. Daily                  Rate Transaction Grouping is used to enable additional dimensions Phase, task, and                  worktag on the billing rate rules.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Daily_Rate_Transaction_Grouping.html", "service": "Revenue_Management"}, {"operation": "Put_Deferred_Cost_Schedule", "description": "This service operation will add or update Deferred Cost Schedules.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Deferred_Cost_Schedule.html", "service": "Revenue_Management"}, {"operation": "Put_Deferred_Cost_Transaction", "description": "This service operation adds or updates Deferred Cost Transactions. Deferred Cost Transaction                  Data includes Deferred Cost Transaction Reference ID, transaction date, customer,                  description, cost type,amount, currency, notes and worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Deferred_Cost_Transaction.html", "service": "Revenue_Management"}, {"operation": "Put_Dunning_Level_Group", "description": "This service operation will Put Dunning Level Group.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Dunning_Level_Group.html", "service": "Revenue_Management"}, {"operation": "Put_Electronic_Invoicing_Acknowledgement", "description": "This operation creates or updates an Electronic Invoicing Acknowledgement instance                  for a customer invoice.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Electronic_Invoicing_Acknowledgement.html", "service": "Revenue_Management"}, {"operation": "Put_External_Worker", "description": "This service operation will add an External Worker. External Worker Data includes                  External Worker Reference ID and External Worker Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_External_Worker.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Admin_Cost_Rate_Type_Type", "description": "Web service for adding Type of Facilities and Admin Cost Rate Types. Facilities and                  Admin Cost Rate Type Types are used for identifying Cost Rate Snapshot Shots and whether                  they are for example \"Provisional,\" \"Final\" etc.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Admin_Cost_Rate_Type_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Basis_Type", "description": "A web service to create facilities and administration basis type.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Basis_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Exception", "description": "This service operation will modify an existing Facilities and Administration Exception                  (if a valid ID is provided) or will create a new one.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Exception.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Object_Class_Mapping", "description": "Make Put Object Class Mapping WS Public. A power user should be able to upload my                  object class mapping via an EIB.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Object_Class_Mapping.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Rate_Agreement", "description": "Web service for adding Rate Agreements and its Cost Rate Types.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Rate_Agreement.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Revenue_Allocation_Profile", "description": "This web service operation adds or updates facilities and administration revenue allocation                  profiles, including profile ID, profile name, cost share, revenue distribution percent,                  worktag type reference, and worktag reference.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Revenue_Allocation_Profile.html", "service": "Revenue_Management"}, {"operation": "Put_Facilities_and_Administration_Waived_Expense_Allocation_Profile", "description": "This service operation will Add or Update a Facilities and Administration Waived Expense                  Allocation Profile for use on a Facilities and Administration Exception on an Award.                  Facilities and Administration Waived Expense Allocation Profile data includes ID,                  Name, and Facilities and Administration Waived Expense Distribution Data.  Facilities                  and Administration Waived Expense Distribution Data includes Allocation Distribution                  percent and Facilities and Administration Waived Expense Worktag Offest Override Data.                  Facilities and Administration Waived Expense Worktag Offset Override Data includes                  Accounting Worktag Type and Worktag.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Facilities_and_Administration_Waived_Expense_Allocation_Profile.html", "service": "Revenue_Management"}, {"operation": "Put_Grants_Management_Configuration", "description": "Creates a new general and company level grants management configurations, or updates                  the existing ones. When the request contains general configuration, you can create                  or update the configuration. However, when the request contains company level configurations,                  you can create, update, or delete the configurations. There's no reference ID for                  general configuration. When you specify company level configurations, data to be populated                  includes: Company, Valid Line Types, and Default Line Types.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Grants_Management_Configuration.html", "service": "Revenue_Management"}, {"operation": "Put_Hold_Reason", "description": "This service operation will add or update Hold Reasons", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Hold_Reason.html", "service": "Revenue_Management"}, {"operation": "Put_Merchant_Customer_Profile", "description": "Service operation updates Merchant Customer Profiles.  Sets Customer Reference, Customer                  Information, Primary Card, Merchant Account Reference, Merchant Account ID, Credit                  Card Type Reference, First Name, Last Name, Expiration Date, Last 4 Digits of Credit                  Card Number, Merchant Processing ID, Reply Reason Code, Reply Reason Description,                  and Customer Profile ID.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Merchant_Customer_Profile.html", "service": "Revenue_Management"}, {"operation": "Put_Opportunity", "description": "This service operation will add or update Opportunities", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Opportunity.html", "service": "Revenue_Management"}, {"operation": "Put_Order_Fulfillment_Transaction", "description": "This service operation will add Order Fulfillment Transactions. Order Fulfillment                  Transaction Data includes Order Fulfillment  Transaction Reference ID, Customer, Customer                  Contract Line, Fulfillment date, quantity fulfilled, Ship to Customer, Ship To Address.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Order_Fulfillment_Transaction.html", "service": "Revenue_Management"}, {"operation": "Put_Percent_Complete_Configuration", "description": "This service operation will add or update a Percent Complete Configuration.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Percent_Complete_Configuration.html", "service": "Revenue_Management"}, {"operation": "Put_Project_Billing_Rate_Sheet", "description": "This service operation will add or update a Project Billing Rate Sheet.  A Project                  Billing Rate Sheets consists of Name, Currency, Effective Date for a rate.  The rate                  consists of Project Rate Members, Project Role and Project Billing Hourly Ratewi               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Project_Billing_Rate_Sheet.html", "service": "Revenue_Management"}, {"operation": "Put_Project_Billing_Rate_Sheet_Configuration_Line", "description": "Creates a new Project Billing Rate Sheet Configuration Line (or updates an existing                  Project Billing Rate Sheet Configuration Line) with the information supplied in the                  request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Project_Billing_Rate_Sheet_Configuration_Line.html", "service": "Revenue_Management"}, {"operation": "Put_Project_Rate_Category", "description": "Service to create Project Rate Categories and Project Rate Category Members", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Project_Rate_Category.html", "service": "Revenue_Management"}, {"operation": "Put_Revenue_Adjustment_Reason", "description": "Creates a new Revenue Adjustment Reason (or updates an existing Revenue Adjustment                  Reason) with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Revenue_Adjustment_Reason.html", "service": "Revenue_Management"}, {"operation": "Put_Revenue_Allocation_Configuration", "description": "This service operation will add or update the Tenant's Revenue Allocation Configuration.                  Revenue Allocation Configuration Data includes Allocation in Summary, Default Revenue                  Allocation Configuration Line Data, and Override Revenue Allocation Configuration                  Line Data. Default Revenue Allocation Configuration Line Data includes Lower Range                  Percentage, Upper Range Percentage, Allocation Basis, and Fair Value Price List. Override                  Revenue Allocation Configuration Line Data contains Override Revenue Allocation Configuration                  ID, Override Revenue Allocation Configuration Line, Company, Fair Value Price List,                  Lower Range Percentage, Upper Range Percentage, Revenue Allocation Calculation Basis,                  and Override Revenue Allocation Configuration Line Details Data. Override Revenue                  Allocation Configuration Line Details Data contains  Override Revenue Allocation Configuration                  Line Details ID,  Override Revenue Allocation Configuration Line Details, Sales Item                  Group, Sales Item, Lower Range Percentage, Upper Range Percentage, and Allocation                  Basis.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Revenue_Allocation_Configuration.html", "service": "Revenue_Management"}, {"operation": "Put_Revenue_Category", "description": "This service operation will add or update Revenue Categories. Revenue Category data                  includes Revenue Category ID, Name and Tax Applicability.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Revenue_Category.html", "service": "Revenue_Management"}, {"operation": "Put_Revenue_Category_Hierarchy", "description": "Allows the entry of Revenue Category Hierarchies which embody Revenue Categories and                  a can contain child Revenue Category Hierarchies.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Revenue_Category_Hierarchy.html", "service": "Revenue_Management"}, {"operation": "Put_Revenue_Recognition_Schedule_Template", "description": "This service operation will add or update Revenue Recognition Schedule Templates.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Revenue_Recognition_Schedule_Template.html", "service": "Revenue_Management"}, {"operation": "Put_Salary_Cap", "description": "This service operation will add or update Award Salary Cap. Award Salary Cap Data                  includes Award Salary Cap Reference ID, Award Limit Name, Award Limit Snapshot  Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Salary_Cap.html", "service": "Revenue_Management"}, {"operation": "Put_Salary_Over_the_Cap_Type", "description": "Adds or updates Salary Over The Cap Type. Used in the Salary Cap definition as a worktag                  and is passed to payroll to calculate payroll amounts exceeding the Salary Cap.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Salary_Over_the_Cap_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Sales_Item", "description": "This service operation will add or update Sales Items.  Sales items are goods and                  services which a company sells.  Sales Item data includes  Sales Item ID, Item Name,                  Revenue Category, Item Description, Item Identifier, Unit of Measure, Unit Price,                  Currency, Tax Applicability, Sales Item Group.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Sales_Item.html", "service": "Revenue_Management"}, {"operation": "Put_Sales_Item_Fair_Value_Price_List", "description": "Creates a new Sales Item Fair Value Price List (or updates an existing Sales Item                  Fair Value Price List) with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Sales_Item_Fair_Value_Price_List.html", "service": "Revenue_Management"}, {"operation": "Put_Sales_Item_Group", "description": "This service operation will add or update Sales Item Groups.  Assign sales items to                  sales item groups to make it easier to search for and select items. Items can belong                  to multiple groups. Sales Item Group data includes Sales Item Group ID and Name.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Sales_Item_Group.html", "service": "Revenue_Management"}, {"operation": "Put_Sales_Item_Price_List", "description": "Creates a new Sales Item Price List (or updates an existing Sales Item Price List)                  with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Sales_Item_Price_List.html", "service": "Revenue_Management"}, {"operation": "Put_Special_Condition_Type", "description": "Adds or updates the special condition types for a sponsor.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Special_Condition_Type.html", "service": "Revenue_Management"}, {"operation": "Put_Sponsor", "description": "This service operation will add or update a Sponsor. Sponsor data includes Sponsor                  ID, Sponsor Reference ID, Sponsor Name, Sponsor Type, Payment Terms, default Payment                  Type, Business Entity data, Settlement Account data, Customer Status data, Remit-From                  Sponsor, default Currency, Accepted Currencies, Business Entity Alternate Name Data,                  Business Entity Attachment data.   Business Entity data includes Name, Tax ID, External                  ID, Contact Information data, and Business Entity Logo.  Contact Information data                  includes Address, Phone, Email, Instant Messenger and Web Address data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Sponsor.html", "service": "Revenue_Management"}, {"operation": "Put_Subaward", "description": "This service operation will update a Subaward.  Subaward data includes Subaward Reference,                  Award Contract Reference, Award Contract Line Reference, Subrecipient Reference, Location                  Reference, Subject to FFATA Reference, Attachment Data, and Subaward Contact Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Subaward.html", "service": "Revenue_Management"}, {"operation": "Put_Subaward_Risk_Assessment", "description": "This service operation will add or update Subaward Risk Assessment. Subaward Risk                  Assessment Data includes Subaward   Risk Assessment ID, Subaward Reference, Start                  Date, End Date, Evaluation Date, Risk Evaluation Level Reference, Comments, URL, Attachment                  Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Subaward_Risk_Assessment.html", "service": "Revenue_Management"}, {"operation": "Put_Subrecipient", "description": "This service operation will create or update Subrecipients. Subrecipient Data includes                  Subrecipient Reference ID, DUNS+4, Is SAM Registered flag, Tax Location Reference,                  and Attachment Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Subrecipient.html", "service": "Revenue_Management"}, {"operation": "Put_Subrecipient_Risk_Record", "description": "This service operation will add or update Subrecipient Risk Records. Subrecipient                  Risk Record Data includes Subrecipient Risk Record Reference ID, Subrecipient Reference,                  Start Date, End Date, Evaluation Date, Risk Level Reference, Comments, URL, and Attachment                  Data.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Subrecipient_Risk_Record.html", "service": "Revenue_Management"}, {"operation": "Put_Usage_Based_Transaction", "description": "This service operation will add or update Usage Based Transactions. Usage Based Transaction                  Data includes Usage Based Transaction Reference ID, transaction date, quantity, unit                  of measure, location information (country/region/city/postal code), description, and                  contract line (or customer and sales item if contract line is not known).               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Usage_Based_Transaction.html", "service": "Revenue_Management"}, {"operation": "Put_Usage_Billing_Rate", "description": "This service operation will add or update a Usage Billing Rate.  A Usage Billing Rate                  consists of Name, Description and the rules to determine what rate to apply to a Usage                  Based Transaction.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Usage_Billing_Rate.html", "service": "Revenue_Management"}, {"operation": "Put_Worker_Rule_Billing_Rate", "description": "Creates a new Worker Rule Billing Rate (or updates an existing Worker Rule Billing                  Rate) with the information supplied in the request.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Put_Worker_Rule_Billing_Rate.html", "service": "Revenue_Management"}, {"operation": "Submit_Award", "description": "This service operation will add or update Awards and submit to the Award business                  process. Award data includes Award Reference ID, Submit Flag, Locked in Workday Flag,                  Award Number, Company, Sponsor Award Reference Number,  Award Name, Award Description,                  Effective and Signed Dates, Award Type, Purpose Code, Payment Terms, Institutional                  ID, Related Award, Organizations for Award Reference, Sub Award Flag, Sponsor, Flowt                  Through Sponsor, Bill to Sponsor, Payment Type, Letter of Credit, Letter of Credit                  Document ID, Currency, Sponsor Direct Cost, Sponsor Facilities and Administration                  Amount, Cost Share Total Amount, Authorized Amount, Cost Share Required by Sponsor                  Flag, Anticipated Sponsor Direct Cost Amont, Anticipated Facilities and Administration                  Amount, Award Schedule, CFDA Number, CFDA Number Reference, CFDA Description, NSF                  Code, Proposal ID, Proposal Version, Award Notes, Billing Notes, Award Contract Line                  Data, and Award Attachement Data. Award Contract Line Data includes ID, Line Number,                  Revenue Category, Line Type, Line Description, Deferred Revenue Flag, Primary Grant                  Flag, Grant, Line Amount, Rate Agreement, Cost Rate Type, Exception, Revenue Allocation                  Profile, Basis Limit Data, Start and End Dates, Description, Line Invoice Memo Override,                  Default Worktags, Supplier, Line Billing Notes, and Revenue Recognition Line Notes.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Award.html", "service": "Revenue_Management"}, {"operation": "Submit_Award_Amendment", "description": "Submit Award Amendment", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Award_Amendment.html", "service": "Revenue_Management"}, {"operation": "Submit_Award_Proposal", "description": "This service operation will add or update an Award Proposal.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Award_Proposal.html", "service": "Revenue_Management"}, {"operation": "Submit_Bad_Debt_Writeoff", "description": "This service operation will create a new Customer Bad Debt Writeoff and submit to                  the Writeoff Bad Debt business process.This operation is Add Only and cannot be used                  to update existing write off instances.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Bad_Debt_Writeoff.html", "service": "Revenue_Management"}, {"operation": "Submit_Billing_Schedule", "description": "This service operation will add or update Billing Schedules and submit to the Billing                  Schedule business process.                    Billing Schedule data includes, but is not limited to Billing Schedule ID, Generate                  Installments flag, Submit flag, Status, Currency, Company, Bill-To Customer, Billing                  Method, Billing Frequency, From Date, To Date, Number of Installments, Use From Date                  flag, Use To Date flag, Day of Month, Schedule Type, Schedule Description, Milestones,                  Schedule On Hold flag, Auto-Submit for Approval, Payment Terms, Payment Type, PO Number,                  Invoice Type, Invoice Memo, Contract Lines, Installment Data.                    Billing Installment Data includes Billing Installment Reference ID, Status, Installment                  Date, Due Date, From Date, To Date, On Hold flag, Amount, Milestone, Override Invoice                  Header flag, Payment Terms, Payment Type, PO Number, Invoice Type, Invoice Memo, Billing                  Installment Line Data.                    Billing Installment Line Data contains Order, Override Line flag, Contract Line, Line                  Item Description, Quantity, UOM, Quantity 2, UOM2, Unit Price, Amount, From Date,                  To Date, Tax Applicability, Tax Code, Deferred Revenue flag, Memo, Worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Billing_Schedule.html", "service": "Revenue_Management"}, {"operation": "Submit_Cash_Sale", "description": "This operation replaces the deprecated Put Cash Sale web service operation.  It will                  Record a Cash Sale. Record Cash Sale is used to record a sale without an invoice,                  including the receipt of a payment in cash or check.  Cash Sale data includes Cash                  Sale ID,  Locked in Workday Flag, Company, Currency, Customer, Tax Code, Payment Date,                  Payment Type, Check Number, Record Deposit Flag,  Bank Account, Deposit Reference                  Number,  Memo, Control Total Amount  and Customer Invoice Line data.  Line data includes                  Intercompany Affiliate, Sales Item, Revenue Category, Quantity, Unit Cost, Extended                  Amount, Line Memo and Worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Cash_Sale.html", "service": "Revenue_Management"}, {"operation": "Submit_Contract_Rate_Sheet", "description": "This service operation will add or update Contract Rate Sheet. Contract Rate Sheet                  includes contract rates for workers and different billing rate rules.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Contract_Rate_Sheet.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer", "description": "This service operation initiates the Customer Event business process for new customers.                  If you update the information for existing customers, the web service also initiates                  any of these business processes associated with that change:                  - Customer Banking Details Change                  - Customer Credit Details Change                  - Customer Payment Change                  - Customer Summary Change                  If an update isn't associated with the listed business processes, then it's approved                  automatically.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Contract", "description": "This service operation will add or update Customer Contracts and submit to the Customer                  Contract business process.  Customer Contract data includes Customer Contract ID,                  Submit Flag, Locked in Workday Flag, Document Number, Company, Currency, Customer,                  Effective and Signed Dates, Contract Amount, Payment Terms, Payment Type, Hold  Flag,                  PO Number, Salesperson and Customer Contract Line data.  Line data includes  Sales                  Item, Revenue Category, Quantity, Unit Cost, for Fixed and Transaction-Based Price                  Types, and Recurring Installment Attributes for Recurring Price Type, and Worktags.                  The request criteria can be for a single transaction based on Reference or Contract                  Number, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Contract.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Contract_Amendment", "description": "This service operation will add or update Customer Contracts Amendments and submit                  to the Customer Contract business process. Customer Contract Amendment data includes                  Customer Contract ID, Submit Flag, Locked in Workday Flag, Document Number, Company,                  Currency, Customer, Effective and Signed Dates, Contract Amount, Payment Terms, Payment                  Type, Hold Flag, PO Number, Salesperson and Customer Contract Line data. Line data                  includes Sales Item, Revenue Category, Quantity, Unit Cost, for Fixed and Transaction-Based                  Price Types, and Recurring Installment Attributes for Recurring Price Type, and Worktags.                  The request criteria can be for a single transaction based on Reference or Contract                  Number, or all transaction can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Contract_Amendment.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Contract_Change_Order", "description": "This service operation will add Customer Contract Change Order. Customer Contract                  Change Order data includes Customer Contract, Amendment Type, Amendment Effective                  Date, Customer Contract Lines, Quantity, Quantity2, Change Order Amount, Notes and                  attachment.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Contract_Change_Order.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Deposit", "description": "Customer Deposit Web Service. Allows a new Customer Deposit to be created, or an existing                  Customer Deposit to be edited. Can be used as Public Web Service or for iLoads. Contains:                  Locked in Workday, Company, Currency, Payment Deposit Date, Bank Account, Deposit                  Reference Number, Control Total Amount               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Deposit.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Invoice", "description": "This service operation will add or update Customer Invoices and submit to the Customer                  Invoice business process.  Customer Invoice data includes Customer Invoice ID, Submit                  Flag, Locked in Workday Flag, Document Number, Company, Currency, Customer, Document                  Date, Due Date Override, Control Total Amount, Payment Terms, Hold from Payment Flag,                  Document Received, Reference, PO Number, Memo, Attachment and Customer Invoice Line                  data.  Line data includes Intercompany Affiliate, Sales Item, Revenue Category, Quantity,                  Unit Cost, Extended Amount, Line Memo and Worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Invoice.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Invoice_Adjustment", "description": "This service operation will add or update Customer Invoice Adjustments and submit                  to the Customer Invoice Adjustment business process.  Customer Invoice Adjustment                  data includes Customer Invoice Adjustment ID, Submit Flag, Locked in Workday Flag,                  Document Number, Company, Currency, Customer, Increase Amount Flag, Adjustment Reason,                  Adjustment Date, Due Date Override, Control Total Amount, Original Invoice, Payment                  Terms, Hold from Payment Flag,  PO Number, Contract, Memo, Attachment and Customer                  Invoice Line data.  Line data includes Intercompany Affiliate, Sales Item, Revenue                  Category, Quantity, Unit Cost, Extended Amount, Line Memo and Worktags.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Invoice_Adjustment.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Refund", "isDeprecated": true, "description": "DEPRECATED: This web service operation is deprecated in v36.0.  Please use Submit                  Customer Refund Document web service operation instead.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Refund.html", "service": "Revenue_Management"}, {"operation": "Submit_Customer_Refund_Document", "description": "Web service task to create and submit Customer Refund Document", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Customer_Refund_Document.html", "service": "Revenue_Management"}, {"operation": "Submit_Intercompany_Contract_Billing_Schedule", "description": "This web service operation will add or update Billing Schedules for intercompany customer                  contracts and submit to the Billing Schedule business process.                    Intercompany Contract Billing Schedule Data includes, but is not limited to Billing                  Schedule ID, Submit flag, Status, Currency, Company, Bill-To Customer, Bill-To Company,                  Billing Method, Billing Frequency, Schedule Description, Schedule On Hold flag, Auto-Submit                  for Approval, Payment Terms, Payment Type, PO Number, Invoice Type, Invoice Memo,                  and Intercompany Customer Contract Lines.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Intercompany_Contract_Billing_Schedule.html", "service": "Revenue_Management"}, {"operation": "Submit_Intercompany_Customer_Contract", "description": "Webservice Task to Create/Edit an Intercompany Contract.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Intercompany_Customer_Contract.html", "service": "Revenue_Management"}, {"operation": "Submit_Netting_Transaction", "description": "This service operation will add Netting Transaction and submit to the Netting Transaction                  business process.  Netting Transaction Data includes Submit Flag, Company, Currency,                  Netting Rule, Netting Transaction Date, Supplier Invoice Date On or After Date, Supplier                  Invoice Date On or Before Date, Customer Invoice Date On or After Date, Customer Invoice                  Date On or Before Date, Attachment, Supplier Invoice for Netting Data, and Customer                  Invoice for Netting Data.  Supplier Invoice for Netting Data includes Supplier Invoice                  Reference or Supplier Invoice Adjustment Reference and Amount to Net.  Customer Invoice                  for Netting Data includes Customer Invoice Reference or Customer Invoice Adjustment                  Reference and Amount to Net.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Netting_Transaction.html", "service": "Revenue_Management"}, {"operation": "Submit_Percent_Complete_for_Revenue", "description": "This service operation will update Percent Complete Project.", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Percent_Complete_for_Revenue.html", "service": "Revenue_Management"}, {"operation": "Submit_Revenue_Recognition_Schedule", "description": "This service operation will add or update Revenue Recognition Schedules and submit                  to the Revenue Recognition Schedule business process.                    Revenue Recognition Schedule data includes, but is not limited to Revenue Recognition                  Schedule ID, Generate Installments flag, Submit flag, Status, Currency, Company, Customer,                  Amount Distribution Method, Frequency, From Date, To Date, Number of Installments,                  Schedule Type, Schedule Description, Milestones, Schedule On Hold flag, Contract Lines,                  Installment Data.                    Revenue Recognition Installment Data includes Revenue Recognition Installment Reference                  ID, Status, Installment Date, From Date, To Date, On Hold flag, Amount, Currency,                  Milestones, Revenue Recognition Installment Line Data.                    Revenue Recognition Installment Line Data contains Contract Line, Revenue Category,                  Sales Item, Line Item Description, Worktags, From Date, To Date, Amount.                                     The request criteria can be for a single transaction based on Reference, or all transaction                  can be retrieved if no criteria is specified.               ", "link": "https://community.workday.com/sites/default/files/file-hosting/productionapi/Revenue_Management/v38.2/Submit_Revenue_Recognition_Schedule.html", "service": "Revenue_Management"}]